install-windows-en.org
#+TITLE: Installation of MathComp on Windows 10

We present three ways to install MathComp on Windows 10.

Method 1 and 2 rely on [[https://www.cygwin.com][cygwin]] to recreate a Linux-like environment
Warning: file access with cygwin is slow compared to a native Linux
installation.  Method 2 uses a custom installation of "opam for
Windows" (cygwin's opam does not seem to be usable), it results in a
more comfortable working environment, but installation is slow and may
fail because opam supports for Windows is rather new.  Method 1 avoids
opam completely and uses the binary distribution of Coq for Windows 10
to compile the desired libraries one after the other using ~make~. It
is quick, has always worked, but the result can be a bit clunky.

Method 3 relies on Windows Subsystem for Linux. The resulting working
environment is reportedly comfortable, but WSL is rather new, and
installation is slow.

* Methods 1 and 2
** Step 0: Install cygwin
- Download and execute ~setup-x86_64.exe~ from [[https://www.cygwin.com/][https://www.cygwin.com/]]
  + Choose ~xinit~, ~make~, ~diffutils~, ~patch~, ~unzip~, ~git~,
    ~emacs~, ~emacs-X11~, ~vim~, ~texlive~ to have a minimal working
    environment
- Double-click the "Cygwin64 Terminal" on the Desktop
- In the terminal, execute ~startxwin~ to start X11
  + An Cygwin-X11 icon (a black "C" with a green "X" inside) appears
    among the System Tray icons
  + Right-clicking the Cygwin-X11 icon gives access to ~xterm~
    * You can launch ~emacs~ from the command line
** method 1: cygwin + binaries (Install MathComp using Coq Binaries)
*** Step 1-a: Install Coq
- Download and execute ~coq-8.9.1-installer-windows-x86_64.exe~ from
  the [[https://github.com/coq/coq/releases/latest][release page]]
  + This will add the Coq distribution as the ~C:\Coq~ directory
- Add ~/cygdrive/c/coq/bin~ to ~PATH~
  + By appending ~export PATH=${PATH}:/cygdrive/c/coq/bin/~ to
    ~.bashrc~ for example
*** Step 1-b: Install MathComp
- The MathComp library that comes with the Coq binaries is maybe not
  up-to-date
  + ~rm /cygdrive/c/coq/lib/user_contrib/mathcomp~
- Install MathComp 1.9.0
  + Download the [[https://github.com/math-comp/math-comp/releases][source files]]
  + Installation amounts to: unzip, untar, cd, make, make install
  + As a result the MathComp libraries populate the ~user-contrib~
    directory of the Coq installation
** method 2: cygwin + opam (Install MathComp using opam)
The following results in a more comfortable working environment but
the process is slow and may fail. Still, at least, it should leave you
with a working OCaml compiler to compile Coq from the source and go on
installing MathComp as in Method 1.
*** Step 2-a: Install opam
- For opam to work, add a few more useful programs by re-running the
  cygwin installer
  + ~rsync~, ~curl~, ~m4~, ~perl~, ~mingw64-x86_64-gcc-core~
- [[https://github.com/fdopen/opam-repository-mingw/releases/download/0.0.0.2/opam64.tar.xz][Download]] opam
- ~tar -xf opam64.tar.xz~
- ~bash opam64/install.sh~
- ~opam init default "https://github.com/fdopen/opam-repository-mingw.git#opam2" -c "ocaml-variants.4.07.1+mingw64c" --disable-sandboxing~
  + this modifies ~.bash_profile~
- ~eval $(opam config env)~
- ~opam switch create 4.07.1+mingw64c~
  + if for some reason the right OCaml compiler is still not here
*** Step 2-b: Install Coq
- ~opam install camlp5~ ([2019-07-12 Fri]'s version: 7.06)
- ~opam install ocamlfind~ ([2019-07-12 Fri]'s version: 1.8.0)
- ~opam install depext~ ([2019-07-12 Fri]'s version: transition)
- ~opam install depext-cygwinports~ ([2019-07-12 Fri]'s version: 0.0.7)
  + Add ~/usr/x86_64-w64-mingw32/sys-root/mingw/bin~ to ~PATH~ as indicated
- ~opam install pcre~
  + mail fail partially, but this is no worry because it should not
    prevent you from installing Coq, MathComp, etc.
- try ~opam install lablgtk~
  + the complete installation is likely to fail, this means no
    ~coqIDE~, but this is no problem because there is Proof General
- ~opam install num~ ([2019-07-12 Fri]'s version: 1.2)
- ~opam repo add coq-released https://coq.inria.fr/opam/released~
- ~opam install coq.8.9.1~
*** Step 2-c: Install MathComp
- ~export CAML=/home/username/.opam/4.07.1+mingw64c/bin/~
- ~export COQBIN=/home/username/.opam/4.07.1+mingw64c/bin/~
- ~opam install coq-mathcomp-ssreflect~ ([2019-07-12 Fri]'s version: 1.9.0)
- ~opam install coq-mathcomp-fingroup~
- ~opam install coq-mathcomp-algebra~
- ~opam install coq-mathcomp-field~
* Method 3: WSL + opam
** Step 0: Install WSL
- Check the version of Windows 10: type ~Windows Key + R~, execute ~winver~.
  + Upgrade to 1903 if necessary
- Choose a Linux distribution for WSL ([[https://docs.microsoft.com/en-us/windows/wsl/install-win10][ref]]):
  1. Execute Windows PowerShell with administrator rights
  2. ~Enable-WindowsOptionalFeature -Online -FeatureName Microsoft-Windows-Subsystem-Linux~
  3. Reboot
  4. Download and install a Linux distribution from Microsoft Store
     * Debian GNU/Linux is a safe choice, Ubuntu 18.04 might be easier for beginners
- Execute Linux from Windows' Start Menu or Search Windows
  1. Choose a user name and password
  2. Install basic software using the package manager
     - ~sudo add-apt-repository ppa:avsm/ppa~ (Ubuntu 18.04 only)
     - ~sudo apt update~
     - ~sudo apt-get install emacs~
- Better to have n Xorg server to use emacs
  1. download and install [[https://sourceforge.net/projects/vcxsrv/][VcXsrv]]
  2. execute VcXsrv using the ~XLaunch~ icon
  3. choose the options ~multiple windows~ ・ ~start no client~
- Sett the ~DISPLAY~ environment variable through WSL's shell: ~export DISPLAY=localhost:0.0~
  + You may want to add this comment to ~.bashrc~ (checked with Ubuntu 18.04)
  + Start VcXsrv, restart bash, and then emacs should be usable as an independent window
** Install opam, Coq, and MathComp
- Install opam using the package manager of WLS's Linux distribution:
  1. ~sudo apt install opam~
  2. ~opam init --disable-sandboxing~ (~--disable-sandboxing~ may not be required anymore in a near future)
     * Don't worry if it takes time
  3. ~opam switch create 4.08.1~
     * Takes time
  4. See [[https://opam.ocaml.org/doc/Install.html][opam website]] for other Linux distributions (not based on Debian)
- ~opam install coq~
  + Current version [2019-09-24 Tue] is 8.9.1
  + Takes time
  + To use development versions [2019-09-24 Tue] (such as beta's):
    * ~opam repo add coq-core-dev https://coq.inria.fr/opam/core-dev~
    * ~opam install coq.8.10+beta3~
- You need GTK+ header files to install CoqIDE
  + ~sudo apt install libgtk2.0-dev libexpat1-dev~ (checked with Ubuntu 18.04 and Debian 10)
    * or ~sudo apt install libgtk-3-dev libgtksourceview-3.0-dev libexpat1-dev~ for the more recent Coq 8.10
  + ~opam install coqide~
    * or ~opam install coqide.8.10+beta3~ for Coq 8.10
- Install MathComp
  + ~opam repo add coq-released https://coq.inria.fr/opam/released~
  + ~opam install coq-mathcomp-ssreflect~, etc.
    * [2019-09-25 Wed] opam seems to want to use dev versions of Coq
* Install Proof General
- Install proof general following the instructions [[https://proofgeneral.github.io/][online]]
- Add this point, you can already use Coq and /some version/ of
  MathComp almost as if you were on a Linux-based system
* Troubleshooting and Failures
** Cygwin Troubleshooting
- Cygwin may be confused by a non-American keyboard; you can change
  the keyboard layout with ~setxkbmap~, e.g., for a Japanese keyboard,
  ~setxkbmap -model jp106 -layout jp~
- You may want to get rid of the CAPS LOCK key by creating a file,
  say, ~Xmodmap~ with the following contents:
#+BEGIN_SRC
keycode 66 = Control_L
clear Lock
add Control = Control_L
#+END_SRC
  Then append the following to ~.bashrc~:
#+BEGIN_SRC
xmodmap /home/username/Xmodmap
#+END_SRC
** Opam Troubleshooting
- You may witness ~Device or resource busy~ when installing with opam,
  they seem to be harmless
- ~opam install lablgtk~ fails with the following error despite having
  ~libgtk2.0-devel~ and ~mingw64-x86_64-gtk2.0~ installed with cygwin:
#+BEGIN_SRC
This package requires gtk+ 2.0 development packages installed on your system
#+END_SRC
** Cygwin's opam troubleshooting
*** Install OCaml with cygwin's opam on Windows 10
It is possible to install the OCaml compiler using cygwin's opam
(using the procedure below) but the compiler obtained this way cannot
be used to compile Coq.
- Re-run the cygwin installer to install ~opam~ (version 2 or higher)
- ~opam init~ (Answer "y" to questions)
- ~eval $(opam env)~
- Check that OCaml has been properly installed
  + ~ocaml --version~ (version at the time of this writing [2019-07-08 Mon]: 4.04.2)
- ~opam switch create 4.07.1~
- ~eval $(opam env)~
- ~opam install camlp5~ (version 7.06.10 [2019-07-08 Mon])
- ~opam install ocamlfind~ (version 1.8.0 [2019-07-08 Mon])
- ~opam install num.1.2~
** Failure Installing Coq from the source code using cygwin's opam's OCaml
*** Using cygwin's opam
Installation fails because Coq's ~configure~ is confused by cygwin:
- ~opam repo add coq-released https://coq.inria.fr/opam/released~
- ~opam install coq.8.0.1~
*** From the source, using cygwin's opam's Ocaml
Installation fails with an "address space is already occupied error" for ~dllunix.so~:
- Download ~coq.8.9.1.tar.gz~
- unzip, untar, cd, make









